### 주어진 타이타닉 데이터를 확인하고 결측치가 있는 컬럼을 전처리 진행 하시오
- 결측 삭제
- 결측 대체
- 위 두가지 방법을 활용하여 각 컬럼의 결측을 처리하고 진행 한 이유를 간단히 설명하시오.

In [ ]:
05_데이터분석/머신러닝전처리/결측처리연습문제/titanic_train.csv

In [79]:
import os
import pandas as pd
import numpy as np
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
from sklearn.preprocessing import LabelEncoder

In [48]:
titanic_df = pd.read_csv('./titanic_train.csv', encoding = 'cp949')

In [49]:
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [50]:
titanic_df.shape

(891, 12)

#### 컬럼별 결측 확인

In [51]:
titanic_df.isnull().sum(axis = 0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### 결과를 보면 cabin, age 에서 결측치가 나타난다.
####  결측이 있는 컬럼을 처리
- 먼저 결측치가 나타난 Age 값은 상대적으로 승객 data에서 승객을 구별하는데 있어서 우선순위가 밀린다고 생각하였고
    - Age 열을 삭제해주었다.
    - Cabin 은 객실 번호로 승객들이 배의 ticket 을 구매했고 직접적으로 승객들을 확인할 수 있는 data 라 생각, NaN 값과 이웃하는 값이 같은 객실이라고 판단하고 결측치를 객실없음으로 대체했다.

In [52]:
# age 열의 삭제
titanic_df.drop('Age', axis = 1, inplace = True)
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500,NaN,S

In [53]:
titanic_df.isnull().sum(axis = 0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [109]:
titanic_df = titanic_df.fillna('No_cabin')

In [110]:
titanic_df.isnull().sum(axis = 0)

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64